[
    {
        "id": 1,
        "title": "SOEKARNO",
        "img": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSsCWQ2dOTOTpQFcHPOTav5DJokHY0wB2iQvQ&s",
        "description": "Soekarno: Indonesia Merdeka adalah film biografi yang mengangkat kisah hidup Soekarno, proklamator kemerdekaan dan presiden pertama Indonesia. Film ini disutradarai oleh Hanung Bramantyo dan dirilis pada 11 Desember 2013,Film ini menggambarkan perjalanan hidup Soekarno sejak masa muda, ketika ia masih bernama Koesno, hingga menjadi seorang pemimpin bangsa yang memproklamasikan kemerdekaan Indonesia pada 17 Agustus 1945. Fokus cerita terletak pada perjuangan Soekarno dalam melawan penjajahan Belanda dan Jepang,pengaruhnya terhadap pergerakan kemerdekaan, serta pergulatan pribadi dan politik yang dihadapinya.Film ini diproduksi oleh Multivision Plus Pictures. Naskahnya ditulis berdasarkan kisah nyata yang diperoleh dari berbagai sumber sejarah. Hanung Bramantyo berusaha menampilkan sisi manusiawi Soekarno selain sebagai seorang tokoh besar. pengarang (penulis skenario) film ini adalah Ben Sihombing."
    }, 
    {
        "id": 2,
        "title": "Sang Pencerah",
        "img": "https://cdn-brilio-net.akamaized.net/webp/news/2021/08/10/211399/1538993-7-film-perjuangan-indonesia-tayang-agustus-2021-temani-hari-kemerdekaan.jpg",
        "description": "Film ini menceritakan perjalanan hidup Ahmad Dahlan (nama kecil: Muhammad Darwis), seorang pemuda dari Yogyakarta, yang menentang berbagai praktik Islam yang dianggap tidak sesuai dengan ajaran Al-Qur'an dan Hadis. Ahmad Dahlan berusaha mengajarkan umat Islam untuk lebih terbuka terhadap ilmu pengetahuan modern dan menentang praktik takhayul serta bid'ah yang sudah mengakar di masyarakat.\n\nNaskah film ini ditulis oleh Hanung Bramantyo bersama Akmal Nasery Basral."
    },
    {
        "id": 3,
        "title": "Kartini",
        "img": "https://cdn-brilio-net.akamaized.net/webp/news/2021/08/10/211399/1538995-7-film-perjuangan-indonesia-tayang-agustus-2021-temani-hari-kemerdekaan.jpg",
        "description": "Film ini menceritakan perjuangan Kartini (diperankan oleh Dian Sastrowardoyo) yang hidup di tengah budaya Jawa pada akhir abad ke-19, di mana perempuan tidak memiliki kebebasan untuk menentukan jalan hidupnya. Kartini tumbuh sebagai anak bupati yang cerdas dan gemar membaca. Ia memiliki akses ke buku-buku dan surat kabar asing yang membukakan wawasannya tentang hak-hak perempuan dan kesetaraan. \n\nNamun, perjuangan Kartini tidaklah mudah. Ia harus menghadapi tradisi pingitan, tekanan dari keluarga besar, serta sistem patriarki yang membatasi hak perempuan, termasuk akses terhadap pendidikan. Melalui surat-suratnya yang terkenal, Kartini mengungkapkan gagasannya tentang pentingnya pendidikan untuk perempuan agar mereka dapat menjadi individu yang merdeka dan mandiri. \n\nNaskah film Kartini ditulis oleh Hanung Bramantyo bersama Bagus Bramanti"
    },
    {
        "id": 4,
        "title": "SANG KIAI",
        "img": "https://cdn-brilio-net.akamaized.net/webp/news/2021/08/10/211399/1538992-7-film-perjuangan-indonesia-tayang-agustus-2021-temani-hari-kemerdekaan.jpg",
        "description": "Sang Kiai adalah film biografi sejarah Indonesia yang disutradarai oleh Rako Prijanto. Film ini mengangkat kisah perjuangan KH. Hasyim Asy’ari, pendiri Nahdlatul Ulama (NU), dalam melawan penjajahan Jepang dan mempertahankan kemerdekaan Indonesia melalui jalur agama dan pendidikan. Film ini dirilis pada 30 Mei 2013. Film ini berlatar belakang masa penjajahan Jepang dan perjuangan kemerdekaan Indonesia. Cerita berfokus pada sosok KH. Hasyim Asy’ari (diperankan oleh Ikranagara), yang berperan penting dalam membangkitkan semangat rakyat melalui ajaran Islam untuk melawan penjajah. Ia menyerukan Resolusi Jihad, yang mendorong rakyat Indonesia, khususnya santri dan ulama, untuk mempertahankan kemerdekaan Indonesia, termasuk dalam pertempuran di Surabaya pada 10 November 1945."
    },
    {
        "id": 5,
        "title": "SULTAN AGUNG",
        "img": "https://cdn-brilio-net.akamaized.net/webp/news/2021/08/10/211399/1538996-7-film-perjuangan-indonesia-tayang-agustus-2021-temani-hari-kemerdekaan.jpg",
        "description": "Sultan Agung: Tahta, Perjuangan, Cinta adalah film drama sejarah Indonesia yang mengangkat kisah hidup Sultan Agung Hanyakrakusuma, salah satu raja terbesar dari Kerajaan Mataram Islam yang memerintah pada abad ke-17. Film ini disutradarai oleh Hanung Bramantyo dan dirilis pada 23 Agustus 2018. Film ini menceritakan perjalanan hidup Sultan Agung (diperankan oleh Ario Bayu), seorang pemimpin Kerajaan Mataram Islam yang menghadapi tantangan besar dari dalam dan luar kerajaannya. Sultan Agung bertekad mempersatukan Nusantara dan melawan penjajahan VOC (Vereenigde Oostindische Compagnie) yang dipimpin oleh Jan Pieterszoon Coen."
    },
    {
        "id": 6,
        "title": "PERBURUAN",
        "img": "https://m.media-amazon.com/images/M/MV5BZDliODYwYjQtYmQ4NC00ZTAxLWJkZjYtMTIxOGQ5YWRjMTRmXkEyXkFqcGc@._V1_.jpg",
        "description": "Perburuan adalah film Indonesia yang dirilis pada 2022. Film ini merupakan adaptasi dari novel karya Pramoedya Ananta Toer yang berjudul Perburuan. Novel tersebut adalah salah satu karya besar Pramoedya yang menggambarkan keadaan sosial dan politik pada masa penjajahan Jepang di Indonesia, khususnya pada masa pendudukan Jepang selama Perang Dunia II. Film Perburuan menceritakan tentang sekelompok pemuda yang berjuang melawan penjajahan Jepang di Indonesia. Para pemuda ini berusaha menyelamatkan diri dan melawan ketidakadilan yang terjadi pada masa tersebut. Konflik internal, keberanian, serta pergulatan moral menjadi tema utama dalam film ini."
    },
    {
        "id": 7,
        "title": "TJOKROAMINOTO",
        "img": "https://upload.wikimedia.org/wikipedia/id/4/41/Poster_Guru_Bangsa_Tjokroaminoto.jpg",
        "description": "TJOKROAMINOTO adalah film biografi Indonesia yang mengisahkan kehidupan Tjokroaminoto, seorang tokoh pergerakan kemerdekaan Indonesia yang sangat berpengaruh, terutama dalam membentuk pemikiran-pemikiran nasionalis. Film ini disutradarai oleh Ery Mefri dan dirilis pada 2015. Film ini mengangkat kisah Tjokroaminoto (diperankan oleh Deddy Mizwar), seorang tokoh besar yang memainkan peran penting dalam kebangkitan nasional Indonesia. Tjokroaminoto dikenal sebagai pemimpin pergerakan yang mendidik banyak tokoh besar dalam sejarah Indonesia, termasuk Soekarno dan Sutan Sjahrir. Ia adalah seorang pendiri organisasi Sarekat Islam (SI) yang bertujuan untuk memperjuangkan hak-hak rakyat Indonesia serta mengusir penjajahan Belanda."
    },
    {
        "id": 8,
        "title": "Merah Putih",
        "img": "https://akcdn.detik.net.id/community/media/visual/2014/10/19/6db2eef1-6b1f-4a72-b9d5-4ebc9ec4cc3f.jpg?w=397",
        "description": "Merah Putih adalah film perang Indonesia yang dirilis pada 17 Agustus 2009, bertepatan dengan Hari Kemerdekaan Indonesia. Film ini disutradarai oleh Rako Prijanto dan merupakan salah satu film yang menceritakan perjuangan tentara Indonesia dalam meraih kemerdekaan dari penjajahan Belanda pada masa Revolusi Nasional Indonesia. Merah Putih menceritakan kisah perjuangan sekelompok pemuda Indonesia yang terdiri dari berbagai latar belakang etnis dan suku, yang berjuang bersama untuk mempertahankan kemerdekaan Indonesia dari penjajah Belanda. Cerita ini fokus pada persatuan yang tercipta di antara mereka meskipun ada perbedaan, serta semangat juang yang tinggi untuk meraih kebebasan."
    },
    {
        "id": 9,
        "title": "TheEast",
        "img": "https://dorangadget.com/wp-content/uploads/2024/08/Film-Perjuangan-Indonesia-566x800.jpg",
        "description": "ilm The East atau yang berjudul asli De Oost ini merupakan film Belanda yang berlatar perang Belanda-Indonesia pada 1946. Film ini menceritakan seorang prajurit bernama Johan yang kagum dengan Kapten Angkatan Darat Raymond Westerling, pimpinan kontra pemberontakan gerilyawan Indonesia, sejenis pasukan khusus yang dibentuk KNIL. ilm ini dirilis resmi pada 13 Mei 2021."
    },
    {
        "id": 10,
        "title": "BUMI MANUSIA",
        "img": "https://dorangadget.com/wp-content/uploads/2024/08/Film-Perjuangan-Indonesia-Bumi-Manusia-566x800.jpg",
        "description": "Bumi Manusia adalah film drama sejarah Indonesia yang diadaptasi dari novel terkenal karya Pramoedya Ananta Toer. Film ini disutradarai oleh Robert Ronny dan dirilis pada 15 Agustus 2019. Bumi Manusia mengisahkan perjuangan seorang pemuda bernama Minke (diperankan oleh Iqbaal Ramadhan), seorang pribumi yang terpelajar di masa penjajahan Belanda pada awal abad ke-20. Minke adalah seorang jurnalis yang cerdas dan memiliki pandangan kritis terhadap keadaan sosial-politik Indonesia pada masa itu, khususnya terkait dengan penjajahan dan ketidakadilan terhadap rakyat Indonesia. Film ini juga menyoroti kisah cinta Minke dengan seorang gadis Indo, Annelies (diperankan oleh Mawar Eva de Jongh), yang menjadi simbol dari penghalang sosial dan rasial di era kolonial. Minke harus menghadapi berbagai tantangan, termasuk diskriminasi, ketidakadilan, dan konfrontasi dengan penguasa kolonial Belanda. Perjuangan Minke untuk membela hak-hak pribumi dan mempertanyakan ketidakadilan menggambarkan semangat perlawanan yang menginspirasi."
    },
    {
        "id": 11,
        "title": "TJOETNJADHIEN",
        "img": "https://o-cdn-cas.oramiland.com/parenting/images/Film_Sejarah_-1.width-800.format-webp.webp",
        "description": "Film ini mengisahkan kehidupan Tjoet Nja' Dhien (diperankan oleh Christine Hakim), seorang pejuang Aceh yang berperan besar dalam perlawanan terhadap Belanda pada abad ke-19. Tjoet Nja' Dhien adalah istri dari Teuku Cik Di Tiro, salah satu pemimpin perlawanan Aceh yang terkenal. Setelah suaminya meninggal, Tjoet Nja' Dhien melanjutkan perjuangan untuk membebaskan Aceh dari penjajahan Belanda. Tjoet Nja' Dhien adalah film biografi sejarah Indonesia yang mengangkat kisah perjuangan Tjoet Nja' Dhien, seorang pahlawan wanita yang terkenal karena keberaniannya melawan penjajahan Belanda di Aceh. Film ini disutradarai oleh Eros Djarot dan dirilis pada 1988. "
    },
    {
        "id": 12,
        "title": "KADET 1947",
        "img": "https://tugujatim.id/wp-content/uploads/2023/08/8699795e-7e3f-481c-8238-77df1810ee76-1.jpg",
        "description": "Kadet 1947 adalah film Indonesia yang mengangkat perjuangan para pemuda Indonesia dalam mempertahankan kemerdekaan setelah Proklamasi Kemerdekaan Indonesia pada 17 Agustus 1945. Film ini menggambarkan peristiwa sejarah yang terjadi pada tahun 1947, khususnya terkait dengan Agresi Militer Belanda yang pertama dan peran para pahlawan muda dalam menghadapi tantangan besar di masa awal kemerdekaan. Film ini berfokus pada sekelompok pemuda-pemudi yang tergabung dalam Kesatuan Tentara Pelajar (KTP), yang berjuang untuk melawan pasukan Belanda. Para pemuda ini, meskipun masih sangat muda, memiliki semangat perjuangan yang tinggi dan berani mengambil risiko untuk membela kemerdekaan Indonesia. Meskipun mereka tidak memiliki pengalaman tempur yang memadai, mereka tetap berjuang dengan gigih, menunjukkan bahwa semangat juang tidak tergantung pada usia. Konflik film ini mencerminkan kehidupan para pejuang muda yang dihadapkan pada berbagai tantangan berat, baik dari sisi fisik maupun psikologis. Mereka harus melawan musuh yang jauh lebih terlatih, sekaligus menghadapi dilema moral dalam perjuangan mereka."
    }
]
